[
    {
        "author": "Landen Tomlin",
        "genre": "Alternative Indie",
        "content": "Ants From Up There, the second album by British band Black Country, New Road, is an extraordinary blend of emotion, innovation, and musicianship. Released in 2022, the album breaks away from traditional genre boundaries, weaving together post-rock, art rock, and experimental pop, all while maintaining an emotional core that resonates deeply with listeners.  What makes Ants From Up There stand out is its raw vulnerability, particularly in its lyrics. The album’s themes of longing, loss, and personal struggle are poetically expressed by lead vocalist Isaac Wood, whose departure from the band shortly before the album’s release adds another layer of poignancy. Songs like \"The Place Where He Inserted the Blade\" and \"Concorde\" are hauntingly beautiful, with intricate arrangements that build into cathartic crescendos.  The band’s musicianship is another highlight. Their use of violin, saxophone, and unconventional song structures makes each track feel like an emotional journey. The music shifts from delicate melodies to grand, sweeping moments, creating a sense of tension and release that keeps you engaged throughout the album.  Ants From Up There is not just an album; it's an experience that draws you in and leaves you reflecting on its beauty long after it ends.",
        "summary": "Ants From Up There has been on constant replay for me, what's so good about it?",
        "date": "10-10-2024",
        "title": "The Album of the Year?",
        "image": "https:\/\/media.pitchfork.com\/photos\/61649694110e7cd222907396\/master\/pass\/Black-Country-New-Road.jpg",
        "user_id": 1
    },
    {
        "author": "Josh H",
        "genre": "Metal",
        "content": "This year I decided to go again to a huge rock\/metal festival in my hometown called Louder than Life. I got to see almost 50 bands, had some fun experiences, got to mosh, and got to see some of the bands I've wanted to see since I was young. However, a significant downer for me was when I got my phone pickpocketed and stolen, and in addition to that the culture around the festival was significantly different. Not sure that I will actually go again unless it's it includes my absolute favorite bands.",
        "summary": "Metal Festival in Louisville, KY. 10th Anniversary this year, got phone stolen. 5\/10 might not go again.",
        "date": "10-10-2024",
        "title": "Louder Than Life 2024",
        "image": "https:\/\/images.squarespace-cdn.com\/content\/v1\/6043f3491f30ca562809c10b\/1a3c2358-01c4-44fd-875e-bc62e9d4a607\/LTL24_SocialAssets_1200x1500.jpg?format=1500",
        "user_id": 2
    }
]